//  0. Вывести квадрат числа
Console.Clear();
Console.WriteLine("Введите число для выявления квадрата:");
int a = Convert.ToInt32(Console.ReadLine());

Console.WriteLine($"Квадрат числа {a} = {a*a}");

